# SupportSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HandRailType..::..SupportSpacing Property
HandRailType Class See Also
---
The support spacing of the handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SupportSpacing { get; set; }
```

Visual Basic
---
```text
Public Property SupportSpacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SupportSpacing {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for supportSpacing must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The rail has no support or the support has inappropriate layout so the data being set is not applicable. |

# See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace